ch1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 13:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="stack" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org83f4181">1. Building Abstractions with Procedures</a>
<ul>
<li><a href="#org71ee9d5">1.1. The elements of programming</a>
<ul>
<li><a href="#orge3d7ea4">1.1.1. The substitution model</a></li>
<li><a href="#org472ebe1">1.1.2. Applicative order</a></li>
<li><a href="#orgfdf2a1b">1.1.3. Normal order</a></li>
</ul>
</li>
<li><a href="#org22a30a7">1.2. Procedures and the processes they generate</a>
<ul>
<li><a href="#orgd4a6ef3">1.2.1. Recursive processes</a></li>
<li><a href="#org982ca97">1.2.2. Iterative processes</a></li>
<li><a href="#org6fc0a4f">1.2.3. Tree Recursion</a></li>
<li><a href="#org60cb350">1.2.4. Orders of Growth</a></li>
</ul>
</li>
<li><a href="#org29859a6">1.3. Formulating abstractions with higher-order procedures</a>
<ul>
<li><a href="#org0756521">1.3.1. Procedures as arguments</a></li>
<li><a href="#orgb99dd6c">1.3.2. Procedures using lambda</a></li>
<li><a href="#orgd61921e">1.3.3. Using let to create local variables</a></li>
<li><a href="#orga49d13a">1.3.4. Finding roots of equations by the half-interfal method</a></li>
<li><a href="#orgc47cf63">1.3.5. Finding fixed points of functions</a></li>
<li><a href="#org6d0ab87">1.3.6. Procedures as returned values</a></li>
<li><a href="#orge678081">1.3.7. Abstractions and first-class procedures</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org83f4181" class="outline-2">
<h2 id="org83f4181"><span class="section-number-2">1.</span> Building Abstractions with Procedures</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org71ee9d5" class="outline-3">
<h3 id="org71ee9d5"><span class="section-number-3">1.1.</span> The elements of programming</h3>
<div class="outline-text-3" id="text-1-1">
<p>
We can combine simple ideas into a complex one using this:
</p>
<ul class="org-ul">
<li>Primitive expressions: Simplest entities the language is concerned with</li>
<li>Means of combination: Compound elements built from simpler ones</li>
<li>Means of abstraction: How compound elements can be named and manipulated as units</li>
</ul>
</div>
<div id="outline-container-orge3d7ea4" class="outline-4">
<h4 id="orge3d7ea4"><span class="section-number-4">1.1.1.</span> The substitution model</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
The interpreter evaluates the element of the combination and applies
the procedure to the arguments. We can do this by two means. Assuming
the following procedures.
</p>
<div class="org-src-container">
<pre class="src src-racket">(define (square a) (* a a))
(define (sum-of-squares a b) (+ (square a) (square b)))
(define (f a) (sum-of-squares (+ a 1) (* a 2)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org472ebe1" class="outline-4">
<h4 id="org472ebe1"><span class="section-number-4">1.1.2.</span> Applicative order</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Evaluate the arguments then apply, the method the interpreter
actually uses.
</p>
<div class="org-src-container">
<pre class="src src-racket">;; When we evaluate
(f 5)
;; The reductions are as follows
(sum-of-squares (+ 5 1) (* 5 2))
(+ (square 6) (square 10))
(+ (* 6 6) (* 10 10))
(+ 36 100)
136
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfdf2a1b" class="outline-4">
<h4 id="orgfdf2a1b"><span class="section-number-4">1.1.3.</span> Normal order</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Fully expand then reduce, an alternative method.
</p>
<div class="org-src-container">
<pre class="src src-racket">;; When we evaluate
(f 5)
;; We expand everything
(sum-of-squares (+ 5 1) (* 5 2))
(+ (square (+ 5 1)) (square (* 5 2)))
(+ (* (+ 5 1) (+ 5 1)) (* (* 5 2) (* 5 2)))
;; Then reduce
(+ (* 6 6) (* 10 10))
(+ 36 100)
136
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org22a30a7" class="outline-3">
<h3 id="org22a30a7"><span class="section-number-3">1.2.</span> Procedures and the processes they generate</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgd4a6ef3" class="outline-4">
<h4 id="orgd4a6ef3"><span class="section-number-4">1.2.1.</span> Recursive processes</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Consider:
</p>
<div class="org-src-container">
<pre class="src src-racket">(define (factorial n)
  (if (= n 1)
      1
      (* n (factorial (n-1)))))
</pre>
</div>
<p>
If we apply the substitution model we end up with:
</p>
<div class="org-src-container">
<pre class="src src-racket">(factorial 4)
(* 4 (factorial 3))
(* 4 (* 3 (factorial 2)))
(* 4 (* 3 (* 2 (factorial 1))))
(* 4 (* 3 (* 2 1)))
(* 4 (* 3 2))
(* 4 6)
</pre>
</div>
<p>
We can observe the process expands and reduces as it's evaluating the
expressions, the state is held within the chain of deferred
operations, this is a <i>recursive process</i>, since the number of
expansions and reductions grows linearly with n, this is called a
<i>linear recursive process</i>.
</p>
</div>
</div>
<div id="outline-container-org982ca97" class="outline-4">
<h4 id="org982ca97"><span class="section-number-4">1.2.2.</span> Iterative processes</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Now consider the following:
</p>
<div class="org-src-container">
<pre class="src src-racket">(define (factorial n)
  (fact-iter 1 1 n))
(define (fact-iter product counter max-count)
  (if (&gt; counter max-count)
      product
      (fact-iter (* counter product)
                 (+ counter 1)
                 max-count))
</pre>
</div>
<p>
It grows like so:
</p>
<div class="org-src-container">
<pre class="src src-racket">(factorial 4)
(fact-iter 1 1 4)
(fact-iter 1 2 4)
(fact-iter 2 3 4)
(fact-iter 6 4 4)
(fact-iter 24 5 4)
24
</pre>
</div>
<p>
This does not grow and shrink, all the state is contained within the
arguments to the procedures, we could stop and resume the chain at any
point in time if we count with the right arguments to pass to the
parameters.
</p>
</div>
</div>
<div id="outline-container-org6fc0a4f" class="outline-4">
<h4 id="org6fc0a4f"><span class="section-number-4">1.2.3.</span> Tree Recursion</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Consider:
</p>
<div class="org-src-container">
<pre class="src src-racket">(define (fib n)
  (cond ((=n 0) 0)
        ((= n 1) 1)
        (else (+ (fib (- n 1))
                 (fib (- n 2))))))
</pre>
</div>
<p>
It evolves like this
</p>
<div class="org-src-container">
<pre class="src src-racket">                               (fib 4)
                (+ (fib 3)               (fib 2))
        (+ (+ (fib 2) (fib 1))     (+ (fib 1) (fib 0)))
(+ (+ (+ (fib 1) (fib 0)) (fib 1)) (+ (fib 1) (fib 0)))
(+ (+ (+    1       0   )    1   ) (+    1       0))

</pre>
</div>
<p>
The process evolves into a tree of calls to different procedures, hence
it's name.
</p>
</div>
</div>
<div id="outline-container-org60cb350" class="outline-4">
<h4 id="org60cb350"><span class="section-number-4">1.2.4.</span> Orders of Growth</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
\(R(n)\) has an order of growth \(
R(n)=\Theta(f(n))
\) if there are positive
constants \(k_1\) and \(k_2\) independent of n such that:
</p>
\begin{equation}
k_1f(n) \le R(n) \le k_2f(n)
\end{equation}

<p>
The order of growth only provides a crude description of the behavior
of the process, a process with \(n^2\) steps and a process with
\(1000n^2\) steps will all have \(theta(n^2)\) order of growth.
</p>
</div>
</div>
</div>

<div id="outline-container-org29859a6" class="outline-3">
<h3 id="org29859a6"><span class="section-number-3">1.3.</span> Formulating abstractions with higher-order procedures</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org0756521" class="outline-4">
<h4 id="org0756521"><span class="section-number-4">1.3.1.</span> Procedures as arguments</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Procedures that manipulate procedures are called higher-order procedures,
they are useful when the same programming pattern is used
with a number of different procedures.
For example, the following can abstract the pattern of "summing"
numbers, and we can use it to create new procedures that
sum cubes, integers, etc.
</p>
<div class="org-src-container">
<pre class="src src-racket">(define (identity (a) a))
(define (square a) (* a a))
(define (cube a) (* a a a))
(define (1+ a) (+ a 1))
(define (sum term a next b)
  (if (&gt; a b)
      0
      (+ (term a)
         (sum term (next a) next b)))
(define (sum-cubes a b)
  (sum cube a 1+ b))
(define (sum-squares a b)
  (sum square a 1+ b))
(define (sum-ints a b)
  (sum identity a 1+ b))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb99dd6c" class="outline-4">
<h4 id="orgb99dd6c"><span class="section-number-4">1.3.2.</span> Procedures using lambda</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
For trivial procedures, it's often more convenient to directly
specify them without any names, rather than defining them. This
is what lambdas are for, really useful when passing them as
arguments to higher-order procedures.
</p>
<div class="org-src-container">
<pre class="src src-racket">(define (sum-cubes a b)
  (sum (lambda (x) (* x x x)) a 1+ b))
(define (sum-squares a b)
  (sum (lambda (x) (* x x) a 1+ b))
(define (sum-ints a b)
  (sum (lambda (x) x) a 1+ b))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd61921e" class="outline-4">
<h4 id="orgd61921e"><span class="section-number-4">1.3.3.</span> Using let to create local variables</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
Imagine we wanted to express:
\[f(x,y)=x(1+xy)^2+y(1-y)+(1+xy)(1-y)\]
Which could be also expressed as:
\[a=1+xy\]
\[b=1-y\]
\[f(x,y)=xa^2+yb+ab\]
We could do:
</p>
<div class="org-src-container">
<pre class="src src-racket">(define (f x y)
  (define (f-helper a b)
    (+ (* x (square a))
       (* y b)
       (* a b)))
  (f-helper (+ 1 (* x y))
            (- 1 y)))
</pre>
</div>
<p>
Which binds a and b to the computed values before applying
the rest of the procedure, but it's somewhat inconvenient,
for this, we can use the special form called <i>let</i>.
</p>
<div class="org-src-container">
<pre class="src src-racket">(define (f x y)
  (let ((a (+ 1 (* x y)))
        ( b (- 1 y)))
    (+ (* x (square a))
       (* y b)
       (* a b))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga49d13a" class="outline-4">
<h4 id="orga49d13a"><span class="section-number-4">1.3.4.</span> Finding roots of equations by the half-interfal method</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
The half-interval method is a technique for finding the roots
of an equation \(f(x)=0\), where \(f\) is a continuous function and
we count with points \(a\) and \(b\) such that \(f(a) < 0 < f(b)\),
we do this by averaging \(a\) and \(b\) many times, reducing
the interval we're searching on each time. (We're basically binary
searching).
</p>
<div class="org-src-container">
<pre class="src src-racket">;; Helper for the tolerance
(define (close-enough? x y)
  (&lt; (abs (- x y)) 0.001))
;; Actual search
(define (search f neg-point pos-point)
  (let ((midpoint (average neg-point pos-point)))
    (if (close-enough? neg-point pos-point)
        midpoint
        (let ((test-value (f midpoint)))
          (cond ((positive? test-value)
                 (search f neg-point midpoint))
                ((negative? test-value)
                 (search f midpoint pos-point))
                (else midpoint))))))
;; Checks if they're actually of opposite signs
;; and picks on which value passed is the negative
;; one and the positive one in order to pass
;; them correctly to search
(define (half-interval-method f a b)
  (let ((a-value (f a))
        (b-value (f b)))
    (cond ((and (negative? a-value) (positive? b-value))
           (search f a b))
          ((and (negative? b-value) (positive? a-value))
           (search f b a))
          (else
           (error "Valeus are not of opposite sign" a b)))))
;; We can then use it to approximate pi
;; (pi is the point where sin(x) = 0)
(half-interval-method sin 2.0 4.0) ;; 3.14111328125
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc47cf63" class="outline-4">
<h4 id="orgc47cf63"><span class="section-number-4">1.3.5.</span> Finding fixed points of functions</h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
A number \(x\) is the <i>fixed point</i> of a function if \(f(x) = x\), for
some functions we can find this with an initial guess and applying \(f\)
repeatedly until the value does not change very much (a tolerance)
\[f(x), f(f(x)), f(f(f(x))), ...,\]
</p>
<div class="org-src-container">
<pre class="src src-racket">(define tolerance 0.00001)
(define (fixed-point f first-guess)
  (define (close-enough? v1 v2)
    (&lt; (abs (- v1 v2))
       tolerance))
  (define (try guess)
    (let ((next (f guess)))
      (if (close-enough? guess next)
          next
          (try next))))
  (try first-guess))
;; Trying it on cos
(fixed-point cos 1.0)
;; We can even define a sqrt function in terms of this
(define (sqrt x)
  (fixed-point (lambda (y) (average y (/ x y)))
               1.0))
</pre>
</div>
</div>
</div>
<div id="outline-container-org6d0ab87" class="outline-4">
<h4 id="org6d0ab87"><span class="section-number-4">1.3.6.</span> Procedures as returned values</h4>
<div class="outline-text-4" id="text-1-3-6">
<p>
The average damping used in <i>sqrt</i> is useful in general, we can
abstract that by returning it as a procedure.
</p>
<div class="org-src-container">
<pre class="src src-racket">(define (average-damp f)
  (lambda (x) (average x (f x))))
;; We can redefine sqrt in term of this,
;; now the idea that we're really using the average damp
;; is explicit.
(define (sqrt x)
  (fixed-point (average-damp (lambda (y) (/ x y)))
               1.0))
;; We can reuse ideas easily
(define (cube-root x)
  (fixed-point (average-damp (lambda (y) (/ x (square y))))
               1.0))
</pre>
</div>
<p>
We could for example approximate the derivative of a function \(g(x)\), the derivative
is given (in the limit of a small \(dx\)) by:
\[Dg(x)=\frac{g(x+dx)-g(x)}{dx}\]
Thus, we can convert this function into the following procedure:
</p>
<div class="org-src-container">
<pre class="src src-racket">(define dx 0.00001)
(define (deriv g)
  (lambda (x) (/ (- (g (+ x dx)) (g x)) dx)))
;; We can derive a function
(define (cube x) (* x x x))
;; Dg(x) = 3(x^2)
;; Dg(5) = 3(5^2) = 75
((deriv cube) t) ;; 75.0001499...
</pre>
</div>
<p>
We can use this to represent Newton's method, which is a way of finding the roots
of an equation. Newton's method states that if \(g(x)\) is a differentiable function,
a solution to the equation \(g(x) = 0\) is a fixed point of the function \(f(x)\) where
\[f(x) = x - \frac{g(x)}{Dg(x)}\]
Thus, we can express this as
</p>
<div class="org-src-container">
<pre class="src src-racket">(define (newton-transform g)
  (lambda (x) (- x (/ (g x) ((deriv g) x)))))
(define (newtons-method g guess)
  (fixed-point (newton-transform g) guess))
</pre>
</div>
<p>
Then, we can redefine <i>sqrt</i> once again, since what we did before was just a special
case of Newton's method.
</p>
<div class="org-src-container">
<pre class="src src-racket">(define (sqrt x)
  (newtons-method
   (lambda (y) (- (square y) x)) 1.0))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge678081" class="outline-4">
<h4 id="orge678081"><span class="section-number-4">1.3.7.</span> Abstractions and first-class procedures</h4>
<div class="outline-text-4" id="text-1-3-7">
<p>
We've seen how higher-order procedures allow us to represent
abstractions explicity as elements, so that they can be haldled just
like any other computational elements.  In general, programming
languages impose restrictions on the ways in which computational
elements can be manipulated. Elements with the fewest restrictions are
said to have first-class status. Some of the "rights and privileges"
of first-class elements are:
</p>
<ul class="org-ul">
<li>They may be named by variables</li>
<li>They may be passed as arguments to procedures</li>
<li>They may be returned as the results of procedures</li>
<li>They may be included in data structures</li>
</ul>
<p>
Lisp awards procedures full first-class status, allowing for the
expressiveness described before.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: stack</p>
<p class="date">Created: 2026-01-31 Sat 13:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
